----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  masterlog
       log:  C:/Users/nicol/Dropbox/Research Projects/Intergenerational/statalogs/nlillob_20210913_g2sm_peso.log
  log type:  text
 opened on:  13 Sep 2021, 19:24:46

. 
. * Set graph options:
. global gphoptns scheme(lean2) ///
>                                 ytitle("Son's birth weight in grams (2nd generation)") ///
>                                 xtitle("Mother's birth weight in grams (1st generation)") ///
>                                 legend(off)

. 
. ////////////////////////////////////////////////////////////////////////////////
> * Change to directory:
. cd "$dtadir/DEIS"
C:\Users\nicol\Dropbox\Research Projects\Intergenerational\data\dta\DEIS

. 
. * Load data:
. use "${lastworkdata}.dta", clear
(Working dataset 13 Sep 2021)

. 
. * Append counterfactual mothers:
. append using COUNTERFACTUAL_MOTHERS.dta, gen(app_deadmom)
(note: variable NAC_PAIS_ORIGEN_ABUELA was str1, now str40 to accommodate using data's values)
(label SEXO already defined)
(label TIPO_PARTO already defined)
(label TIPO_ATEN already defined)
(label PARTO_LOCAL already defined)
(label NIVEL_X already defined)
(label EST_CIV_MADRE already defined)
(label NACIONALIDAD_MADRE already defined)
(label URBANO_RURAL already defined)
(label COMUNA_RESIDENCIA already defined)
(label REGION_RESIDENCIA already defined)
(label SERV_RES already defined)

. 
. * Fill in missing variables for dead mothers:
. replace sem32m = 1 if NAC_SEMANAS_MADRE >=32 & app_deadmom == 1
(17,201 real changes made)

. replace sem32m = 0 if NAC_SEMANAS_MADRE <=31 & app_deadmom == 1
(9,079 real changes made)

. replace round100m = 1 if mod(NAC_PESO_MADRE, 100) == 0 & mod(NAC_PESO_MADRE, 100) != . & app_deadmom == 1
(4,795 real changes made)

. replace round100m = 0 if mod(NAC_PESO_MADRE, 100) != 0 & mod(NAC_PESO_MADRE, 100) != . & app_deadmom == 1
(21,159 real changes made)

. 
. * Base sample for second generation:
. /* 
> -> children for whom we have mother's birth data: NAC_mrg_mbdata2main == 3
> -> children of mothers who were between 15 and 45 years old at time of birth: 
>                 NAC_EDAD_MADRE >= 15 & NAC_EDAD_MADRE <= 45
> -> children born from 2007 onwards (only 12 births between 2001-2006 given above
>  constraints): NAC_ANO_NAC >= 2007
> -> children born as boys: NAC_SEXO == 1
> */
. gen g2fsmpl = NAC_mrg_mbdata2main == 3 ///
>         & NAC_EDAD_MADRE >= 15 & NAC_EDAD_MADRE <= 45 ///
>         & NAC_ANO_NAC >= 2007 & NAC_SEXO == 1

. 
. * Show birth years for cohorts in sample:
. tab NAC_ANO_NAC g2fsmpl

 Año de la |
  fecha de |        g2fsmpl
nacimiento |         0          1 |     Total
-----------+----------------------+----------
      1992 |   278,981          0 |   278,981 
      1993 |   275,773          0 |   275,773 
      1994 |   273,757          0 |   273,757 
      1995 |   265,901          0 |   265,901 
      1996 |   264,777          0 |   264,777 
      1997 |   259,975          0 |   259,975 
      1998 |   257,103          0 |   257,103 
      1999 |   250,407          0 |   250,407 
      2000 |   248,869          0 |   248,869 
      2001 |   215,709          0 |   215,709 
      2002 |   212,096          0 |   212,096 
      2003 |   230,470          0 |   230,470 
      2004 |   230,348          0 |   230,348 
      2005 |   230,827          0 |   230,827 
      2006 |   231,378          0 |   231,378 
      2007 |   240,011        556 |   240,567 
      2008 |   244,004      2,561 |   246,565 
      2009 |   246,505      5,713 |   252,218 
      2010 |   241,287      9,344 |   250,631 
      2011 |   233,144     14,203 |   247,347 
      2012 |   225,139     18,485 |   243,624 
      2013 |   219,660     22,338 |   241,998 
      2014 |   224,521     26,474 |   250,995 
      2015 |   216,362     28,304 |   244,666 
      2016 |   203,103     28,640 |   231,743 
      2017 |   189,791     29,392 |   219,183 
      2018 |   190,829     30,901 |   221,730 
-----------+----------------------+----------
     Total | 6,400,727    216,911 | 6,617,638 

. 
. * Show birth years for the MOTHERS in the sample:
. tab NAC_ANO_NAC_MADRE g2fsmpl if birth_order_by_mother_u == 1

    Madre: |
 Año de la |
  fecha de |        g2fsmpl
nacimiento |         0          1 |     Total
-----------+----------------------+----------
      1992 |    32,631     32,979 |    65,610 
      1993 |    29,219     30,137 |    59,356 
      1994 |    26,817     26,709 |    53,526 
      1995 |    22,519     22,589 |    45,108 
      1996 |    18,836     18,740 |    37,576 
      1997 |    14,848     14,458 |    29,306 
      1998 |    11,009     10,420 |    21,429 
      1999 |     7,274      6,428 |    13,702 
      2000 |     4,299      3,703 |     8,002 
      2001 |     2,170      1,746 |     3,916 
      2002 |     1,171        709 |     1,880 
      2003 |       498        166 |       664 
      2004 |       230          0 |       230 
      2005 |        33          0 |        33 
      2006 |         3          0 |         3 
-----------+----------------------+----------
     Total |   171,557    168,784 |   340,341 

. 
. * Summarize dependent variable by birth year, restricted to sample:
. tabstat $mydepvar if g2fsmpl == 1, by(NAC_ANO_NAC) s(N mean min max)

Summary for variables: NAC_PESO
     by categories of: NAC_ANO_NAC (Año de la fecha de nacimiento)

NAC_ANO~C |         N      mean       min       max
----------+----------------------------------------
     2007 |       556  3292.754       625      4500
     2008 |      2558  3281.297       395      4864
     2009 |      5705  3277.811       298      4855
     2010 |      9339  3293.705       260      4640
     2011 |     14190  3301.698       220      4769
     2012 |     18475  3313.453       280      4660
     2013 |     22318  3314.637       240      4769
     2014 |     26440  3328.068       200      6375
     2015 |     28283  3324.544       200      5520
     2016 |     28600  3322.089       210      5230
     2017 |     29356  3321.234       240      4935
     2018 |     30883   3323.42       200      5570
----------+----------------------------------------
    Total |    216703  3317.428       200      6375
---------------------------------------------------

. 
. ////////////////////////////////////////////////////////////////////////////////
> * Create 20 gram bins according to mother's birth weight:
. gen int bin20gm = 20*floor(NAC_PESO_MADRE/20)
(6,184,170 missing values generated)

. 
. * Create dummy for surviving year 1 (using the mean and point estimate of the
. * "first stage"):
. gen survivor = rbinomial(1, 1-(0.144-0.0290)) if app_deadmom == 1
(6,617,638 missing values generated)

. 
. * Create dummy for ever having a child (to calculate fertility rates by birth year):
. gen g1_ever_had_child_0118 = NAC_nbirths !=. & NAC_nbirths > 0 if NAC_SEXO == 2
(3,403,044 missing values generated)

. 
. * Create empty variable which will equal 1 if we will impute a birth to a dead girl:
. gen imputed_child = .
(6,643,918 missing values generated)

. 
. * Get birth years of non dead girls that had a child:
. levelsof NAC_ANO_NAC if g1_ever_had_child_0118 == 1 & muerte_1a == 0, local(yearlist)
1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006

. 
. * Loop over years...
. foreach yyyy of local yearlist {
  2.         * Calculate share of women that ever had a child by birth year:
.         sum g1_ever_had_child_0118 if muerte_1a == 0 & NAC_ANO_NAC == `yyyy'
  3.         
.         * Replace empty variable:
.         replace imputed_child = rbinomial(1, r(mean)) if survivor == 1 & NAC_ANO_NAC_MADRE == `yyyy'
  4. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
g1_ever~0118 |    134,535    .4874419    .4998441          0          1
(1,583 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
g1_ever~0118 |    132,961    .4461459    .4970931          0          1
(1,384 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
g1_ever~0118 |    132,514     .403746    .4906496          0          1
(1,332 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
g1_ever~0118 |    128,619    .3504537    .4771139          0          1
(1,165 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
g1_ever~0118 |    127,760    .2940122    .4555992          0          1
(1,168 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
g1_ever~0118 |    125,344    .2337088    .4231908          0          1
(1,055 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
g1_ever~0118 |    124,649    .1718345    .3772381          0          1
(1,071 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
g1_ever~0118 |    121,168    .1129836    .3165741          0          1
(989 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
g1_ever~0118 |    120,048      .06664    .2493986          0          1
(953 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
g1_ever~0118 |    107,144    .0365489    .1876525          0          1
(571 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
g1_ever~0118 |    104,962    .0179112    .1326296          0          1
(565 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
g1_ever~0118 |    111,950    .0059312     .076786          0          1
(759 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
g1_ever~0118 |    112,042    .0020528    .0452615          0          1
(769 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
g1_ever~0118 |    111,467    .0002961    .0172037          0          1
(736 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
g1_ever~0118 |    112,349    .0000267    .0051674          0          1
(738 real changes made)

. 
. * Summarize birth years of the mothers:
. sum NAC_ANO_NAC_MADRE if g2fsmpl == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
NAC_ANO_NA~E |    216,911    1994.501     2.23866       1992       2003

. 
. * Define imputed sample:
. gen imputed_sample = imputed_child == 1 & NAC_PESO_MADRE > 1500 & sem32m == 1 ///
>         & NAC_ANO_NAC_MADRE >= r(min) & NAC_ANO_NAC_MADRE <= r(max)

. 
. * Drop unused observations to speed things up:
. keep if g2fsmpl == 1 | imputed_sample == 1
(6,424,701 observations deleted)

. compress
  variable DEF_EDAD_CANT was int now byte
  variable EEHH_nvsts_y02 was int now byte
  variable EEHH_nvsts_y03 was int now byte
  variable EEHH_nvsts_y06 was int now byte
  variable EEHH_nvsts_y07 was int now byte
  variable EEHH_nvsts_y09 was int now byte
  variable EEHH_nvsts_y11 was int now byte
  variable EEHH_nvsts_y12 was int now byte
  variable EEHH_nvsts_y15 was int now byte
  variable EEHH_nvsts_y16 was int now byte
  variable EEHH_nvsts_y17 was int now byte
  variable EEHH_days_y10 was int now byte
  variable EEHH_days_y11 was int now byte
  variable EEHH_days_y12 was int now byte
  variable EEHH_days_y13 was int now byte
  variable EEHH_days_y14 was int now byte
  variable EEHH_days_y15 was int now byte
  variable EEHH_days_y16 was int now byte
  variable EEHH_days_y17 was int now byte
  variable EEHH_days_y18 was int now byte
  variable EEHH_days_y19 was int now byte
  variable EEHH_days_y20 was int now byte
  variable EEHH_days_y21 was int now byte
  variable EEHH_days_y22 was int now byte
  variable EEHH_days_y23 was int now byte
  variable EEHH_days_y24 was int now byte
  variable EEHH_days_y25 was int now byte
  variable EEHH_days_y26 was int now byte
  variable EEHH_days_y27 was int now byte
  variable EEHH_days_s00 was int now byte
  variable EEHH_days_y10_priv was int now byte
  variable EEHH_days_y11_priv was int now byte
  variable EEHH_days_y12_priv was int now byte
  variable EEHH_days_y13_priv was int now byte
  variable EEHH_days_y14_priv was int now byte
  variable EEHH_days_y15_priv was int now byte
  variable EEHH_days_y16_priv was int now byte
  variable EEHH_days_y17_priv was int now byte
  variable EEHH_days_y18_priv was int now byte
  variable EEHH_days_y19_priv was int now byte
  variable EEHH_days_y20_priv was int now byte
  variable EEHH_days_y21_priv was int now byte
  variable EEHH_days_y22_priv was int now byte
  variable EEHH_days_y23_priv was int now byte
  variable EEHH_days_y24_priv was int now byte
  variable EEHH_days_y25_priv was int now byte
  variable EEHH_days_y26_priv was int now byte
  variable EEHH_days_s00_priv was int now byte
  variable EEHH_nvsts_y11_priv was int now byte
  variable EEHH_nvsts_y15_priv was int now byte
  variable EEHH_nvsts_y16_priv was int now byte
  variable EEHH_nvsts_y17_priv was int now byte
  variable EEHH_days_y10_publ was int now byte
  variable EEHH_days_y11_publ was int now byte
  variable EEHH_days_y12_publ was int now byte
  variable EEHH_days_y13_publ was int now byte
  variable EEHH_days_y14_publ was int now byte
  variable EEHH_days_y15_publ was int now byte
  variable EEHH_days_y16_publ was int now byte
  variable EEHH_days_y17_publ was int now byte
  variable EEHH_days_y18_publ was int now byte
  variable EEHH_days_y19_publ was int now byte
  variable EEHH_days_y20_publ was int now byte
  variable EEHH_days_y21_publ was int now byte
  variable EEHH_days_y22_publ was int now byte
  variable EEHH_days_y23_publ was int now byte
  variable EEHH_days_y24_publ was int now byte
  variable EEHH_days_y25_publ was int now byte
  variable EEHH_days_y26_publ was int now byte
  variable EEHH_days_y27_publ was int now byte
  variable EEHH_days_s00_publ was int now byte
  variable EEHH_nvsts_y02_publ was int now byte
  variable EEHH_nvsts_y03_publ was int now byte
  variable EEHH_nvsts_y06_publ was int now byte
  variable EEHH_nvsts_y07_publ was int now byte
  variable EEHH_nvsts_y09_publ was int now byte
  variable EEHH_nvsts_y11_publ was int now byte
  variable EEHH_nvsts_y12_publ was int now byte
  variable EEHH_nvsts_y15_publ was int now byte
  variable EEHH_nvsts_y16_publ was int now byte
  variable hospvsts_by_02 was int now byte
  variable hospvsts_by_07 was int now byte
  variable hospvsts_by_09 was int now byte
  variable hospvsts_by_10 was int now byte
  variable hospvsts_by_11 was int now byte
  variable hospdays_by_12 was int now byte
  variable hospvsts_by_12 was int now byte
  variable hospdays2_by_12 was int now byte
  variable hospdays_by_13 was int now byte
  variable hospvsts_by_13 was int now byte
  variable hospdays2_by_13 was int now byte
  variable hospdays_by_14 was int now byte
  variable hospvsts_by_14 was int now byte
  variable hospdays2_by_14 was int now byte
  variable hospdays_by_15 was int now byte
  variable hospvsts_by_15 was int now byte
  variable hospdays2_by_15 was int now byte
  variable hospdays_by_16 was int now byte
  variable hospvsts_by_16 was int now byte
  variable hospdays2_by_16 was int now byte
  variable hospdays_by_17 was int now byte
  variable hospvsts_by_17 was int now byte
  variable hospdays2_by_17 was int now byte
  variable hospdays_by_18 was int now byte
  variable hospvsts_by_18 was int now byte
  variable hospdays2_by_18 was int now byte
  variable hospdays_by_19 was int now byte
  variable hospvsts_by_19 was int now byte
  variable hospdays2_by_19 was int now byte
  variable hospdays_by_20 was int now byte
  variable hospvsts_by_20 was int now byte
  variable hospdays2_by_20 was int now byte
  variable hospdays_by_21 was int now byte
  variable hospvsts_by_21 was int now byte
  variable hospdays2_by_21 was int now byte
  variable hospdays_by_22 was int now byte
  variable hospvsts_by_22 was int now byte
  variable hospdays2_by_22 was int now byte
  variable hospdays_by_23 was int now byte
  variable hospvsts_by_23 was int now byte
  variable hospdays2_by_23 was int now byte
  variable hospdays_by_24 was int now byte
  variable hospvsts_by_24 was int now byte
  variable hospdays2_by_24 was int now byte
  variable hospdays_by_25 was int now byte
  variable hospvsts_by_25 was int now byte
  variable hospdays2_by_25 was int now byte
  variable hospdays_by_26 was int now byte
  variable hospvsts_by_26 was int now byte
  variable hospdays2_by_26 was int now byte
  variable hospdays_by_27 was int now byte
  variable hospdays2_by_27 was int now byte
  variable g2fsmpl was float now byte
  variable survivor was float now byte
  variable g1_ever_had_child_0118 was float now byte
  variable imputed_child was float now byte
  variable imputed_sample was float now byte
  variable NAC_PAIS_ORIGEN_MADRE was str41 now str40
  variable NAC_PAIS_ORIGEN_ABUELA was str40 now str1
  variable DEF_GLOSA_OCUPACION was str68 now str27
  variable DEF_CODIGO_TERMINO_DIAGNOSTICO_1 was str19 now str16
  variable DEF_CODIGO_TERMINO_DIAGNOSTICO_2 was str19 now str16
  variable DEF_CODIGO_TERMINO_DIAGNOSTICO_3 was str15 now str14
  variable DEF_CODIGO_TERMINO_DIAGNOSTICO_4 was str29 now str24
  (52,612,080 bytes saved)

. 
. * Display quantiles of the dependent variable by mother's birth weight bin:
. tabstat ${mydepvar} if g2fsmpl == 1 & sem32m == 1 & app_deadmom == 0, ///
>         by(bin20gm) s(N mean min p10 p25 p50 p75 p90 max)

Summary for variables: NAC_PESO
     by categories of: bin20gm 

 bin20gm |         N      mean       min       p10       p25       p50       p75       p90       max
---------+------------------------------------------------------------------------------------------
     240 |         1      3420      3420      3420      3420      3420      3420      3420      3420
     280 |         1      3210      3210      3210      3210      3210      3210      3210      3210
     300 |         3  3466.667      3250      3250      3250      3560      3590      3590      3590
     320 |         1      3390      3390      3390      3390      3390      3390      3390      3390
     340 |         3      3770      3730      3730      3730      3730      3850      3850      3850
     360 |         2    3307.5      3050      3050      3050    3307.5      3565      3565      3565
     380 |         1      3510      3510      3510      3510      3510      3510      3510      3510
     400 |         2    3497.5      3365      3365      3365    3497.5      3630      3630      3630
     420 |         1      3900      3900      3900      3900      3900      3900      3900      3900
     540 |         1      3020      3020      3020      3020      3020      3020      3020      3020
     560 |         1      3025      3025      3025      3025      3025      3025      3025      3025
     640 |         1      4045      4045      4045      4045      4045      4045      4045      4045
     660 |         1      2985      2985      2985      2985      2985      2985      2985      2985
     680 |         1      3240      3240      3240      3240      3240      3240      3240      3240
     700 |         1      3350      3350      3350      3350      3350      3350      3350      3350
     740 |         1      4250      4250      4250      4250      4250      4250      4250      4250
     800 |         2      2655      1760      1760      1760      2655      3550      3550      3550
     820 |         1      2425      2425      2425      2425      2425      2425      2425      2425
     840 |         1      1705      1705      1705      1705      1705      1705      1705      1705
     860 |         3  2959.333      2520      2520      2520      3178      3180      3180      3180
     880 |         2      3295      3220      3220      3220      3295      3370      3370      3370
     900 |         6      3350      3070      3070      3140      3190      3530      3980      3980
     940 |         2      3415      3370      3370      3370      3415      3460      3460      3460
     960 |         2    2997.5      2630      2630      2630    2997.5      3365      3365      3365
     980 |         3  3228.333      3100      3100      3100      3120      3465      3465      3465
    1000 |         2      2995      2830      2830      2830      2995      3160      3160      3160
    1040 |         7      3156      2726      2726      2910      2966      3320      4040      4040
    1060 |         1      3780      3780      3780      3780      3780      3780      3780      3780
    1080 |         1      2580      2580      2580      2580      2580      2580      2580      2580
    1100 |         3      2768      2114      2114      2114      2750      3440      3440      3440
    1120 |         4      3060      2480      2480      2735      3035      3385      3690      3690
    1140 |         3      3000      2950      2950      2950      2965      3085      3085      3085
    1160 |         5      3005      2760      2760      2870      3035      3150      3210      3210
    1180 |         1      3430      3430      3430      3430      3430      3430      3430      3430
    1200 |         6  3268.333      2310      2310      3100      3400      3640      3760      3760
    1220 |         6  3334.167      2425      2425      3195    3452.5      3670      3810      3810
    1240 |         6      3070      2630      2630      2950      3040      3300      3460      3460
    1260 |         3      2960      1980      1980      1980      3430      3470      3470      3470
    1280 |         5      3558      2385      2385      3000      3635      4190      4580      4580
    1300 |        14  2885.929       500      2070      2415      2920      3590      3836      4160
    1320 |        14      3242      2550      2568      3145      3265      3480      3730      3850
    1340 |         8    3052.5      2250      2250      2860    3082.5      3380      3525      3525
    1360 |        10      3042      2040      2345      2920      3045      3280      3650      3870
    1380 |         7  3129.857      2410      2410      2845      2900      3494      3940      3940
    1400 |        29  2657.414       600      1151      1930      2840      3330      3880      4080
    1420 |        18  3211.944      2410      2540      2870      3210      3445      3915      4020
    1440 |        19  3415.684      2500      2670      3100      3320      3815      4150      4430
    1460 |        19  3140.105      2610      2645      2780      3046      3635      3815      3820
    1480 |        21  3107.095      1710      2580      2835      3170      3415      3680      3870
    1500 |        32  3131.344      1670      2550      2950      3145      3460      3600      3800
    1520 |        20   3222.35      2426      2705    2992.5      3250      3450    3772.5      3800
    1540 |        30  3127.167      2010      2340      2772      3185      3430    3817.5      4480
    1560 |        32  3253.156      1545      2715      3080    3357.5      3580      3680      3920
    1580 |        17  3153.118      1790      2460      2908      3190      3525      3740      4060
    1600 |        51  3161.941      1745      2440      2820      3210      3570      3790      4160
    1620 |        34  3153.088      2090      2600      2910    3102.5      3470      3770      3875
    1640 |        37  3294.919      1780      2715      3010      3250      3610      3900      4250
    1660 |        19  3329.632      2548      2780      3115      3270      3470      3990      4230
    1680 |        27  3146.259      2430      2690      2894      3260      3450      3575      3658
    1700 |        58  3082.707       860      2080      2720      3250      3620      3790      4360
    1720 |        48  3174.313      1226      2420      2865      3245      3589      3855      4270
    1740 |        69  3298.797      1930      2395      3120      3365      3640      3780      4500
    1760 |        55  3196.618       980      2280      2980      3285      3540      3840      4240
    1780 |        47  3137.872      1850      2410      2780      3140      3520      3860      4090
    1800 |        95  3290.779       680      2770      3005      3330      3635      3900      4760
    1820 |        38  3374.211      2540      2860      3090      3345      3615      3750      4160
    1840 |       101  3099.436      1050      2410      2890      3140      3444      3750      4400
    1860 |        57  3207.912       540      2460      2920      3280      3620      3830      4370
    1880 |        72  3088.556       620      2490      2955      3200      3430      3610      4070
    1900 |       101  3168.733       510      2435      2830      3210      3610      3910      4575
    1920 |        68  3123.265       910      2400    2762.5      3165      3535      3925      4397
    1940 |       154  3179.903      1090      2370      2820      3270      3580      3790      4310
    1960 |        72  3203.431      1910      2555      2930      3195      3550      3850      4380
    1980 |        91  3168.527      1089      2440      2950      3220      3525      3790      4395
    2000 |       206  3159.976       606      2495      2860      3215      3470      3830      4460
    2020 |       110  3145.864      1080      2210      2850      3255      3525      3910      4536
    2040 |       163  3219.589      1335      2640      2930      3240      3585      3810      4490
    2060 |       128  3182.039       680      2394    2892.5      3230      3535      3870      4350
    2080 |       114  3100.439       590      2340      2815      3165      3490      3760      4662
    2100 |       250  3168.752      1270      2480      2850      3245      3510    3772.5      4430
    2120 |       146  3172.356       532      2475      2915    3267.5      3555      3820      4534
    2140 |       217  3159.811       600      2470      2875      3215      3506      3825      4662
    2160 |       141  3164.021      1140      2500      2880      3220      3515      3865      4270
    2180 |       148  3158.054      1540      2425    2892.5      3245      3470      3715      4430
    2200 |       362  3117.887       490      2500      2878      3190      3496      3800      4370
    2220 |       237  3219.819       545      2605      2960      3230      3620      3805      4515
    2240 |       306  3161.944       470      2560      2882      3225      3520      3760      4410
    2260 |       200   3196.54       365    2612.5      2915      3200    3562.5      3910      4536
    2280 |       195  3134.964       760      2550      2850      3165      3425      3770      4380
    2300 |       438  3149.482       460      2440      2850      3220      3520      3790      4910
    2320 |       297  3167.141       860      2485      2860      3190      3540      3835      4635
    2340 |       415  3131.655       410      2460      2860      3170      3500      3820      4375
    2360 |       291  3159.976       590      2590      2900      3210      3520      3786      4335
    2380 |       296  3181.253      1375      2580      2915      3205    3487.5      3730      4390
    2400 |       747  3148.681       470      2519      2870      3190      3510      3800      5200
    2420 |       377  3135.897       500      2370      2890      3220      3480      3704      4568
    2440 |       687  3125.058       337      2510      2850      3160      3480      3760      4470
    2460 |       450   3079.76       625      2335      2815      3140      3480      3750      4540
    2480 |       419  3096.697       600      2395      2860      3154      3460      3715      4790
    2500 |      1140   3140.22       410    2417.5    2857.5      3180      3510      3800      4920
    2520 |       557  3107.715       712      2420      2835      3160      3455      3760      4536
    2540 |       954  3144.465       330      2520      2900      3180      3460      3740      4690
    2560 |       655  3154.698       800      2490      2900      3190      3510      3775      4455
    2580 |       638  3178.981       540      2575      2920      3215      3520      3745      5570
    2600 |      1513  3146.866       430      2490      2860      3200      3510      3800      4662
    2620 |       883  3172.941       600      2530      2900      3195      3505      3780      4920
    2640 |      1443  3149.731       320      2530      2880      3200      3486      3770      4525
    2660 |       819  3129.857       390      2520      2875      3180      3470      3680      5030
    2680 |       912  3175.819       460      2595      2905    3232.5    3522.5      3750      4635
    2700 |      2126  3164.633       200      2555      2920      3225      3500      3775      4790
    2720 |      1179  3163.927       390      2550      2900      3215      3500      3780      4600
    2740 |      1903  3169.778       380      2550      2910      3220      3500      3750      5643
    2760 |      1180  3148.883       394    2542.5      2890      3185      3495      3790      4780
    2780 |      1202   3198.75       500      2560      2910      3210      3540      3830      4870
    2800 |      2871   3180.11       320      2560      2920      3230      3535      3780      4955
    2820 |      1659  3194.135       590      2530      2960      3250      3540      3800      4940
    2840 |      2575  3175.642       314      2570      2920      3205      3505      3780      4620
    2860 |      1597   3193.02       600      2560      2920      3235      3520      3815      4595
    2880 |      1551  3208.424       740      2650      2950      3230      3520      3785      4990
    2900 |      3780  3197.956       350      2590      2950      3245      3540      3800      4640
    2920 |      1942  3194.859       395      2570      2940      3260      3550      3805      4660
    2940 |      3270  3216.563       362      2620      2960      3245      3550      3820      4540
    2960 |      1926  3187.313       210      2560      2940      3240      3535      3775      4920
    2980 |      2074  3197.976       410      2570      2960      3250      3520      3790      4840
    3000 |      6005  3225.659       270      2630      2980      3270      3560      3820      4904
    3020 |      2513  3227.575       370      2618      2970      3270      3580      3830      4770
    3040 |      4164  3242.447       220      2640      2980      3280      3580      3840      4705
    3060 |      2467  3240.416       340      2661      2960      3280      3566      3830      4656
    3080 |      2350  3252.046       600    2682.5      2990      3280      3570      3850      4831
    3100 |      5653  3267.198       250      2660      3020      3300      3598      3870      5180
    3120 |      2962  3252.679       280      2650      2995      3300      3585      3860      4810
    3140 |      4571  3277.027       385      2690      3022      3315      3600      3850      5040
    3160 |      2454  3263.954       440      2650      3010      3320      3600      3895      4745
    3180 |      2639  3284.983       394      2650      3040      3336      3620      3880      4905
    3200 |      6071  3280.329       295      2700      3018      3320      3610      3865      5337
    3220 |      3075  3276.182       210      2645      3030      3325      3610      3875      4690
    3240 |      5046   3294.34       380      2710      3050      3335      3620      3900      4900
    3260 |      2778  3302.084       220      2710      3035    3347.5      3620      3880      4706
    3280 |      2652  3304.241       420      2750      3060      3340      3630      3880      4750
    3300 |      6044  3315.154       360      2722      3070      3360      3640      3890      5458
    3320 |      3073  3317.289       560      2700      3062      3370      3636      3916      4990
    3340 |      4770  3345.541       300      2755      3100      3400      3665      3920      4870
    3360 |      2821  3316.883       260      2710      3080      3365      3650      3910      5230
    3380 |      2568  3334.761       200      2740      3080      3370      3660      3940      5010
    3400 |      5783  3355.712       290      2770      3090      3390      3690      3960      6310
    3420 |      2978  3333.605       390      2725      3090      3390      3660      3920      4910
    3440 |      4656  3346.896       335      2750      3080      3400    3677.5      3942      4900
    3460 |      2518  3342.932       240      2735      3085    3385.5      3670      3940      4870
    3480 |      2442  3344.952       325      2720      3100      3400      3695      3935      4975
    3500 |      5904   3381.67       300      2800      3125      3425      3720      3980      6375
    3520 |      2582  3380.408       390      2775      3120      3430      3710      3982      4960
    3540 |      4061   3364.24       200      2780      3100      3400      3690      3960      5110
    3560 |      2290  3376.521       570      2820      3120      3410      3710      3951      5050
    3580 |      2032  3380.672       360      2770      3120      3425      3720      4000      4900
    3600 |      4659  3394.532       465      2800      3130      3435      3720      3990      4960
    3620 |      2316  3393.931       434      2800      3135      3450    3732.5      3985      5000
    3640 |      3645  3408.255       360      2800      3154      3440      3744      4025      5130
    3660 |      1833  3418.486       490      2820      3135      3480      3760      4000      5050
    3680 |      1702  3407.895       460      2818      3140      3445      3740      4015      4980
    3700 |      3707  3417.507       535      2800      3160      3470      3750      4014      5100
    3720 |      1864  3414.737       240      2830      3180      3460      3750      4015      4780
    3740 |      2944  3433.762       460      2845      3170      3465      3760      4040      5360
    3760 |      1426  3447.259       405      2785      3160      3500      3790      4110      4945
    3780 |      1381  3445.198       395      2880      3200      3470      3760      4035      4802
    3800 |      3088  3469.623       310      2900      3200      3500      3790      4060      5215
    3820 |      1404  3433.937       570      2815      3160      3500      3780      4060      4740
    3840 |      2156  3470.572       483      2905      3220      3520      3790      4070      5080
    3860 |      1165    3457.1       250      2810      3180      3500      3800      4100      5130
    3880 |      1043  3466.437       625      2830      3195      3490      3810      4080      4920
    3900 |      2395  3480.102       200      2870      3220      3530      3810      4092      4950
    3920 |      1046  3486.582       780      2910      3220      3510      3810      4085      4780
    3940 |      1604  3469.857       550      2885      3225      3510      3795      4088      5242
    3960 |       867  3477.633       520      2880      3215      3510      3810      4096      4750
    3980 |       899  3494.898       550      2855      3215      3530      3835      4130      5080
    4000 |      1997  3506.293       325      2880      3245      3550      3850      4120      5240
    4020 |       801  3499.571       420      2940      3240      3560      3820      4080      4940
    4040 |      1145  3487.635       490      2870      3235      3520      3825      4120      4965
    4060 |       562  3491.347       750      2900      3220      3540      3815      4115      4650
    4080 |       535  3522.398       495      2930      3260      3565      3840      4120      4940
    4100 |      1186  3543.862       285      2930      3275      3575      3880      4175      4920
    4120 |       577  3546.955       550      2940      3300      3590      3910      4210      4890
    4140 |       745   3557.96       310      3000      3290      3590      3900      4190      5120
    4160 |       397  3535.217       682      2955      3275      3560      3892      4136      4855
    4180 |       356  3532.584       728      2880      3265      3595    3892.5      4200      5000
    4200 |       778  3548.585       500      2956      3270      3570      3890      4160      5370
    4220 |       349  3609.731       700      3020      3340      3650      3920      4170      4830
    4240 |       484  3561.252       750      2975      3255    3587.5    3922.5      4230      5520
    4260 |       327  3577.281       710      3000      3305      3600      3930      4170      4630
    4280 |       233   3600.94       210      3070      3330      3630      3960      4250      4815
    4300 |       494  3587.911       560      3070      3335      3630      3905      4190      4595
    4320 |       270   3539.83       580      2855      3310    3607.5      3870      4180      4560
    4340 |       364   3647.89       782      3010      3365      3660    3947.5      4300      5000
    4360 |       167  3609.072      1055      2985      3340      3640      3960      4290      4695
    4380 |       154  3583.578      1560      2880      3310      3625      3935      4178      4925
    4400 |       357  3593.328       835      2945      3290      3640      3960      4260      4930
    4420 |       136  3600.544      1466      3050      3370    3632.5      3915      4160      4800
    4440 |       211  3546.962      1369      2890      3275      3570      3930      4206      4530
    4460 |       122  3527.033      1080      2960      3310      3610      3830      4130      4620
    4480 |        97  3555.412      1400      2980      3290      3650      3910      4100      4530
    4500 |       262  3597.042      1090      3000      3340      3635      3940      4200      4880
    4520 |       109  3549.046      1000      2850      3275      3570      3940      4255      4580
    4540 |       152  3671.421       740      3060      3312      3705    4032.5      4350      4660
    4560 |        86  3615.674      2020      3110      3290      3640      3914      4180      5000
    4580 |        61   3709.77      2580      3125      3440      3750      4050      4222      4840
    4600 |       144  3649.438       380      3110    3447.5      3740      4005      4200      4690
    4620 |        75  3643.093       570      2920      3355      3730      3970      4220      4665
    4640 |        90  3642.867      1410      3000      3340    3757.5      4020      4265      4580
    4660 |        56  3578.571      1450      3060      3240      3560      4005      4320      4550
    4680 |        51  3601.118      2060      2860      3390      3670      3980      4145      4640
    4700 |       114  3606.263       700      3010      3280      3725      4000      4220      4755
    4720 |        47  3679.617      1145      3340      3510      3650      3892      4160      4500
    4740 |        63  3689.254      2100      3150      3405      3690      3985      4280      4662
    4760 |        23  3514.652       960      2955      3480      3640      3870      3980      4465
    4780 |        17  3723.059      2190      3090      3520      3850      4074      4355      4500
    4800 |        52  3717.538      2790      3170      3380      3640      4040      4420      5100
    4820 |        24  3561.208      1226      2930      3230      3685      3955      4430      4530
    4840 |        38  3449.421       895      2640      3100    3562.5      3930      4160      4680
    4860 |        18  3617.111       783      3130      3345      3655      4080      4420      4490
    4880 |        25    3552.8      2020      2730      3260      3726      3990      4170      4560
    4900 |        26  3239.577       630      1705      3070      3480      3780      4035      4645
    4920 |        15      3765      3160      3550      3610      3700      4055      4180      4350
    4940 |        31  3838.355       720      3480      3610      3760      4300      4555      5030
    4960 |        10      3709      2755    2872.5      3350    3887.5      4025    4307.5      4375
    4980 |        14  3932.857      2970      3170      3680    3892.5      4230      4610      4700
    5000 |        36  3769.889      2715      3090      3430      3775      3985      4440      4870
    5020 |        10    3651.5      2920      2935      3030      3795      4070    4307.5      4380
    5040 |        16   3706.25      2980      3140      3400      3703      3930      4250      4665
    5060 |         7      3654      3235      3235      3460      3638      3800      4250      4250
    5080 |         7  3649.143      3230      3230      3300      3544      3750      4550      4550
    5100 |        15  3896.267      2830      3270      3480      3980      4290      4397      4681
    5120 |         7  3646.143      1900      1900      3430      3860      4100      4508      4508
    5140 |         5      3724      3170      3170      3560      3570      4040      4280      4280
    5160 |         3  3597.333      2320      2320      2320      3980      4492      4492      4492
    5180 |         4    3587.5      3220      3220      3270      3465      3905      4200      4200
    5200 |        13  3698.462      2465      3050      3250      3730      4040      4520      4560
    5220 |         3  3664.333      3018      3018      3018      3745      4230      4230      4230
    5240 |         3      3857      3105      3105      3105      3930      4536      4536      4536
    5260 |         7  3631.714      3000      3000      3310      3615      3830      4397      4397
    5280 |         6  3283.333      2590      2590      2820      3130      3430      4600      4600
    5300 |         8  3304.375      2230      2230      3095    3307.5      3640      4120      4120
    5320 |         6    3552.5      3155      3155      3350    3582.5      3705      3940      3940
    5380 |         2      3645      3480      3480      3480      3645      3810      3810      3810
    5400 |         3  3533.333      3170      3170      3170      3280      4150      4150      4150
    5420 |         2      4128      4056      4056      4056      4128      4200      4200      4200
    5480 |         2      3830      2890      2890      2890      3830      4770      4770      4770
    5500 |         4   3318.75      3035      3035      3070      3140    3567.5      3960      3960
    5600 |         1      3560      3560      3560      3560      3560      3560      3560      3560
    5620 |         1      3675      3675      3675      3675      3675      3675      3675      3675
    5640 |         1      3340      3340      3340      3340      3340      3340      3340      3340
    5660 |         1      3790      3790      3790      3790      3790      3790      3790      3790
    5680 |         1      3550      3550      3550      3550      3550      3550      3550      3550
    5720 |         1      3580      3580      3580      3580      3580      3580      3580      3580
    5740 |         2      3915      3460      3460      3460      3915      4370      4370      4370
    5760 |         1      3030      3030      3030      3030      3030      3030      3030      3030
    5800 |         1      3140      3140      3140      3140      3140      3140      3140      3140
    5820 |         1      4095      4095      4095      4095      4095      4095      4095      4095
    5940 |         1      2950      2950      2950      2950      2950      2950      2950      2950
    6000 |         1      2980      2980      2980      2980      2980      2980      2980      2980
    6040 |         1      2454      2454      2454      2454      2454      2454      2454      2454
    6060 |         1      3400      3400      3400      3400      3400      3400      3400      3400
    6320 |         1      3300      3300      3300      3300      3300      3300      3300      3300
    6480 |         1      2935      2935      2935      2935      2935      2935      2935      2935
---------+------------------------------------------------------------------------------------------
   Total |    215069  3317.626       200      2699      3050      3360      3660      3940      6375
----------------------------------------------------------------------------------------------------

. 
. * Impute dependent variable for imputed children of dead mothers:
. forval p = 10(10)90 {
  2.         bys bin20gm: egen ${mydepvar}_p`p' = pctile(cond(g2fsmpl == 1 & sem32m == 1 & app_deadmom == 0, ${mydepvar}, .)), p(`p')
  3.         gen ${mydepvar}_imp`p' = ${mydepvar} if app_deadmom == 0
  4.         replace ${mydepvar}_imp`p' = ${mydepvar}_p`p' if app_deadmom == 1
  5. }       
(30 missing values generated)
(2,514 missing values generated)
(2,305 real changes made)
(30 missing values generated)
(2,514 missing values generated)
(2,305 real changes made)
(30 missing values generated)
(2,514 missing values generated)
(2,305 real changes made)
(30 missing values generated)
(2,514 missing values generated)
(2,305 real changes made)
(30 missing values generated)
(2,514 missing values generated)
(2,305 real changes made)
(30 missing values generated)
(2,514 missing values generated)
(2,305 real changes made)
(30 missing values generated)
(2,514 missing values generated)
(2,305 real changes made)
(30 missing values generated)
(2,514 missing values generated)
(2,305 real changes made)
(30 missing values generated)
(2,514 missing values generated)
(2,305 real changes made)

.         
. ////////////////////////////////////////////////////////////////////////////////
> 
. * Over 32 weeks gestation (of the mother):
. rdbwselect $mydepvar NAC_PESO_MADRE if g2fsmpl == 1 & sem32m == 1, c(1500)
Mass points detected in the running variable.

Bandwidth estimators for sharp RD local polynomial regression.

       Cutoff c =  | Left of c  Right of c            Number of obs =     215069
-------------------+----------------------            Kernel        = Triangular
     Number of obs |       256      214813            VCE method    =         NN
Min of NAC_PESO_MADRE |   240.000 1500.000
Max of NAC_PESO_MADRE |  1495.000 6480.000
    Order est. (p) |         1           1
    Order bias (q) |         2           2
        Unique obs |        86        1148

Outcome: NAC_PESO. Running variable: NAC_PESO_MADRE.
--------------------------------------------------------------------------------
                   |         BW est. (h)          |        BW bias (b)
            Method | Left of c         Right of c | Left of c        Right of c
-------------------+------------------------------+-----------------------------
             mserd |   202.167            202.167 |   394.829           394.829
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. scalar RBW_o32 = e(h_mserd)

. scalar LBW_o32 = e(h_mserd)

. scalar maxwt_o32 = 1500 + RBW_o32

. scalar minwt_o32 = 1500 - LBW_o32

. gen optbw_o32 = NAC_PESO_MADRE >= minwt_o32 & NAC_PESO_MADRE <= maxwt_o32 

. 
. * Baseline:
. * graph:
. rdplot $mydepvar NAC_PESO_MADRE ///
>         if optbw_o32 == 1 & g2fsmpl == 1 & sem32m == 1, ///
>         c(1500) nbins(10) p(2) ///
>         graph_options(${gphoptns} name(${abbrev}_o32_optbw_10bins, replace))
Mass points detected in the running variable.

RD Plot with RD plot with manually set number of bins.

      Cutoff c = 1500 | Left of c  Right of c        Number of obs  =        505
----------------------+----------------------        Kernel         =    Uniform
        Number of obs |       159         346
   Eff. Number of obs |       159         346
  Order poly. fit (p) |         2           2
     BW poly. fit (h) |   200.000     200.000
 Number of bins scale |     1.000       1.000

Outcome: NAC_PESO. Running variable: NAC_PESO_MADRE.
---------------------------------------------
                      | Left of c  Right of c
----------------------+----------------------
        Bins selected |        10          10
   Average bin length |    20.000      20.000
    Median bin length |    20.000      20.000
----------------------+----------------------
    IMSE-optimal bins |        10           4
  Mimicking Var. bins |        17          16
----------------------+----------------------
Rel. to IMSE-optimal: | 
        Implied scale |     1.000       2.500
    WIMSE var. weight |     0.500       0.060
    WIMSE bias weight |     0.500       0.940
---------------------------------------------


. 
. * robust rd estimation:
. rdrobust $mydepvar NAC_PESO_MADRE if g2fsmpl == 1 & sem32m==1, c(1500) scalepar(-1) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

   Cutoff c = 1500 | Left of c  Right of c            Number of obs =     215069
-------------------+----------------------            BW type       =      mserd
     Number of obs |       256      214813            Kernel        = Triangular
Eff. Number of obs |       159         346            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   202.167     202.167
       BW bias (b) |   394.829     394.829
         rho (h/b) |     0.512       0.512
        Unique obs |        86        1148

Outcome: NAC_PESO. Running variable: NAC_PESO_MADRE.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  63.659     104.27   0.6105   0.542   -140.702      268.021
    Bias-corrected |  105.72     104.27   1.0140   0.311   -98.6388      310.084
            Robust |  105.72      121.5   0.8701   0.384   -132.418      343.863
--------------------------------------------------------------------------------
Scale parameter: -1
Estimates adjusted for mass points in the running variable.

. est store ${abbrev}_o32_optbw

. estadd scalar Hopt = e(h_l)

added scalar:
               e(Hopt) =  202.16725

. estadd scalar Nl  = e(N_h_l)

added scalar:
                 e(Nl) =  159

. estadd scalar Nr  = e(N_h_r)

added scalar:
                 e(Nr) =  346

. local ef = e(N_h_l)+e(N_h_r)

. estadd scalar effopt = `ef'

added scalar:
             e(effopt) =  505

. sum $mydepvar if optbw_o32 == 1 & (g2fsmpl == 1 | app_deadmom == 1) & sem32m == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    NAC_PESO |        505    3149.228    560.1878        500       4480

. estadd scalar dvmean = r(mean)

added scalar:
             e(dvmean) =  3149.2277

. 
. * Imputing percentile birth weight of a hypothetical child for dead potential mothers:
. forval p = 10(10)90 {
  2.         * graph:
.         rdplot ${mydepvar}_imp`p' NAC_PESO_MADRE ///
>         if optbw_o32 == 1 & (g2fsmpl == 1 | app_deadmom == 1) & sem32m == 1, ///
>         c(1500) nbins(10) p(2) ///
>         graph_options(${gphoptns} name(${abbrev}i`p'_o32_optbw_10bins, replace))
  3.         
.         * robust rd estimation:
.         rdrobust ${mydepvar}_imp`p' NAC_PESO_MADRE if (g2fsmpl == 1 | app_deadmom == 1) & sem32m==1 , c(1500) scalepar(-1) all
  4.         est store ${abbrev}i`p'_o32_optbw
  5.         estadd scalar Hopt = e(h_l)
  6.         estadd scalar Nl  = e(N_h_l)
  7.         estadd scalar Nr  = e(N_h_r)
  8.         local ef = e(N_h_l)+e(N_h_r)
  9.         estadd scalar effopt = `ef'
 10.         sum ${mydepvar}_imp`p' if optbw_o32 == 1 & (g2fsmpl == 1 | app_deadmom == 1) & sem32m == 1 & ${mydepvar}_imp`p' != . & NAC_PESO_MADRE != . & abs(NAC_PESO
> _MADRE - 1500) <= e(h_l)
 11.         estadd scalar dvmean = r(mean)
 12.         
.         count if (g2fsmpl == 1 | app_deadmom == 1) & sem32m == 1 & ${mydepvar}_imp`p' != . & NAC_PESO_MADRE != . & abs(NAC_PESO_MADRE - 1500) <= e(h_l) & NAC_PESO_M
> ADRE < 1500 & app_deadmom == 1
 13.         estadd scalar N_l_i = r(N)
 14.         
.         count if (g2fsmpl == 1 | app_deadmom == 1) & sem32m == 1 & ${mydepvar}_imp`p' != . & NAC_PESO_MADRE != . & abs(NAC_PESO_MADRE - 1500) <= e(h_l) & NAC_PESO_M
> ADRE >= 1500 & app_deadmom == 1
 15.         estadd scalar N_r_i = r(N)
 16. }
Mass points detected in the running variable.

RD Plot with RD plot with manually set number of bins.

      Cutoff c = 1500 | Left of c  Right of c        Number of obs  =        582
----------------------+----------------------        Kernel         =    Uniform
        Number of obs |       159         423
   Eff. Number of obs |       159         423
  Order poly. fit (p) |         2           2
     BW poly. fit (h) |   200.000     200.000
 Number of bins scale |     1.000       1.000

Outcome: NAC_PESO_imp10. Running variable: NAC_PESO_MADRE.
---------------------------------------------
                      | Left of c  Right of c
----------------------+----------------------
        Bins selected |        10          10
   Average bin length |    20.000      20.000
    Median bin length |    20.000      20.000
----------------------+----------------------
    IMSE-optimal bins |        10           5
  Mimicking Var. bins |        19          17
----------------------+----------------------
Rel. to IMSE-optimal: | 
        Implied scale |     1.000       2.000
    WIMSE var. weight |     0.500       0.111
    WIMSE bias weight |     0.500       0.889
---------------------------------------------

Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

   Cutoff c = 1500 | Left of c  Right of c            Number of obs =     217315
-------------------+----------------------            BW type       =      mserd
     Number of obs |       256      217059            Kernel        = Triangular
Eff. Number of obs |       159         424            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   206.317     206.317
       BW bias (b) |   394.808     394.808
         rho (h/b) |     0.523       0.523
        Unique obs |        86        1171

Outcome: NAC_PESO_imp10. Running variable: NAC_PESO_MADRE.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  170.79     100.33   1.7023   0.089   -25.8527      367.428
    Bias-corrected |  210.44     100.33   2.0975   0.036    13.7973      407.078
            Robust |  210.44      118.4   1.7773   0.076   -21.6237      442.499
--------------------------------------------------------------------------------
Scale parameter: -1
Estimates adjusted for mass points in the running variable.

added scalar:
               e(Hopt) =  206.31701

added scalar:
                 e(Nl) =  159

added scalar:
                 e(Nr) =  424

added scalar:
             e(effopt) =  583

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
NAC_PES~mp10 |        582    3070.593    564.1831        500       4480

added scalar:
             e(dvmean) =  3070.5928
  0

added scalar:
              e(N_l_i) =  0
  78

added scalar:
              e(N_r_i) =  78
Mass points detected in the running variable.

RD Plot with RD plot with manually set number of bins.

      Cutoff c = 1500 | Left of c  Right of c        Number of obs  =        582
----------------------+----------------------        Kernel         =    Uniform
        Number of obs |       159         423
   Eff. Number of obs |       159         423
  Order poly. fit (p) |         2           2
     BW poly. fit (h) |   200.000     200.000
 Number of bins scale |     1.000       1.000

Outcome: NAC_PESO_imp20. Running variable: NAC_PESO_MADRE.
---------------------------------------------
                      | Left of c  Right of c
----------------------+----------------------
        Bins selected |        10          10
   Average bin length |    20.000      20.000
    Median bin length |    20.000      20.000
----------------------+----------------------
    IMSE-optimal bins |        10           5
  Mimicking Var. bins |        19          15
----------------------+----------------------
Rel. to IMSE-optimal: | 
        Implied scale |     1.000       2.000
    WIMSE var. weight |     0.500       0.111
    WIMSE bias weight |     0.500       0.889
---------------------------------------------

Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

   Cutoff c = 1500 | Left of c  Right of c            Number of obs =     217315
-------------------+----------------------            BW type       =      mserd
     Number of obs |       256      217059            Kernel        = Triangular
Eff. Number of obs |       159         423            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   202.433     202.433
       BW bias (b) |   393.050     393.050
         rho (h/b) |     0.515       0.515
        Unique obs |        86        1171

Outcome: NAC_PESO_imp20. Running variable: NAC_PESO_MADRE.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   122.5     100.43   1.2198   0.223   -74.3297      319.335
    Bias-corrected |  162.37     100.43   1.6168   0.106   -34.4609      359.204
            Robust |  162.37     118.12   1.3746   0.169   -69.1419      393.885
--------------------------------------------------------------------------------
Scale parameter: -1
Estimates adjusted for mass points in the running variable.

added scalar:
               e(Hopt) =  202.43339

added scalar:
                 e(Nl) =  159

added scalar:
                 e(Nr) =  423

added scalar:
             e(effopt) =  582

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
NAC_PES~mp20 |        582    3103.918     537.984        500       4480

added scalar:
             e(dvmean) =  3103.9175
  0

added scalar:
              e(N_l_i) =  0
  77

added scalar:
              e(N_r_i) =  77
Mass points detected in the running variable.

RD Plot with RD plot with manually set number of bins.

      Cutoff c = 1500 | Left of c  Right of c        Number of obs  =        582
----------------------+----------------------        Kernel         =    Uniform
        Number of obs |       159         423
   Eff. Number of obs |       159         423
  Order poly. fit (p) |         2           2
     BW poly. fit (h) |   200.000     200.000
 Number of bins scale |     1.000       1.000

Outcome: NAC_PESO_imp30. Running variable: NAC_PESO_MADRE.
---------------------------------------------
                      | Left of c  Right of c
----------------------+----------------------
        Bins selected |        10          10
   Average bin length |    20.000      20.000
    Median bin length |    20.000      20.000
----------------------+----------------------
    IMSE-optimal bins |        10           4
  Mimicking Var. bins |        19          17
----------------------+----------------------
Rel. to IMSE-optimal: | 
        Implied scale |     1.000       2.500
    WIMSE var. weight |     0.500       0.060
    WIMSE bias weight |     0.500       0.940
---------------------------------------------

Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

   Cutoff c = 1500 | Left of c  Right of c            Number of obs =     217315
-------------------+----------------------            BW type       =      mserd
     Number of obs |       256      217059            Kernel        = Triangular
Eff. Number of obs |       150         370            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   199.614     199.614
       BW bias (b) |   391.783     391.783
         rho (h/b) |     0.510       0.510
        Unique obs |        86        1171

Outcome: NAC_PESO_imp30. Running variable: NAC_PESO_MADRE.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  98.289     101.47   0.9686   0.333   -100.597      297.175
    Bias-corrected |  138.46     101.47   1.3645   0.172   -60.4268      337.346
            Robust |  138.46     118.82   1.1652   0.244   -94.4325      371.352
--------------------------------------------------------------------------------
Scale parameter: -1
Estimates adjusted for mass points in the running variable.

added scalar:
               e(Hopt) =  199.61365

added scalar:
                 e(Nl) =  150

added scalar:
                 e(Nr) =  370

added scalar:
             e(effopt) =  520

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
NAC_PES~mp30 |        520    3138.772    508.2541        600       4480

added scalar:
             e(dvmean) =  3138.7721
  0

added scalar:
              e(N_l_i) =  0
  71

added scalar:
              e(N_r_i) =  71
Mass points detected in the running variable.

RD Plot with RD plot with manually set number of bins.

      Cutoff c = 1500 | Left of c  Right of c        Number of obs  =        582
----------------------+----------------------        Kernel         =    Uniform
        Number of obs |       159         423
   Eff. Number of obs |       159         423
  Order poly. fit (p) |         2           2
     BW poly. fit (h) |   200.000     200.000
 Number of bins scale |     1.000       1.000

Outcome: NAC_PESO_imp40. Running variable: NAC_PESO_MADRE.
---------------------------------------------
                      | Left of c  Right of c
----------------------+----------------------
        Bins selected |        10          10
   Average bin length |    20.000      20.000
    Median bin length |    20.000      20.000
----------------------+----------------------
    IMSE-optimal bins |        10           4
  Mimicking Var. bins |        19          17
----------------------+----------------------
Rel. to IMSE-optimal: | 
        Implied scale |     1.000       2.500
    WIMSE var. weight |     0.500       0.060
    WIMSE bias weight |     0.500       0.940
---------------------------------------------

Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

   Cutoff c = 1500 | Left of c  Right of c            Number of obs =     217315
-------------------+----------------------            BW type       =      mserd
     Number of obs |       256      217059            Kernel        = Triangular
Eff. Number of obs |       150         370            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   198.690     198.690
       BW bias (b) |   391.696     391.696
         rho (h/b) |     0.507       0.507
        Unique obs |        86        1171

Outcome: NAC_PESO_imp40. Running variable: NAC_PESO_MADRE.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  77.033     101.55   0.7585   0.448   -122.009      276.074
    Bias-corrected |  117.44     101.55   1.1565   0.247   -81.5977      316.485
            Robust |  117.44     118.84   0.9883   0.323    -115.47      350.358
--------------------------------------------------------------------------------
Scale parameter: -1
Estimates adjusted for mass points in the running variable.

added scalar:
               e(Hopt) =  198.68984

added scalar:
                 e(Nl) =  150

added scalar:
                 e(Nr) =  370

added scalar:
             e(effopt) =  520

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
NAC_PES~mp40 |        520    3153.873    504.9565        600       4480

added scalar:
             e(dvmean) =  3153.8731
  0

added scalar:
              e(N_l_i) =  0
  71

added scalar:
              e(N_r_i) =  71
Mass points detected in the running variable.

RD Plot with RD plot with manually set number of bins.

      Cutoff c = 1500 | Left of c  Right of c        Number of obs  =        582
----------------------+----------------------        Kernel         =    Uniform
        Number of obs |       159         423
   Eff. Number of obs |       159         423
  Order poly. fit (p) |         2           2
     BW poly. fit (h) |   200.000     200.000
 Number of bins scale |     1.000       1.000

Outcome: NAC_PESO_imp50. Running variable: NAC_PESO_MADRE.
---------------------------------------------
                      | Left of c  Right of c
----------------------+----------------------
        Bins selected |        10          10
   Average bin length |    20.000      20.000
    Median bin length |    20.000      20.000
----------------------+----------------------
    IMSE-optimal bins |        10           5
  Mimicking Var. bins |        19          16
----------------------+----------------------
Rel. to IMSE-optimal: | 
        Implied scale |     1.000       2.000
    WIMSE var. weight |     0.500       0.111
    WIMSE bias weight |     0.500       0.889
---------------------------------------------

Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

   Cutoff c = 1500 | Left of c  Right of c            Number of obs =     217315
-------------------+----------------------            BW type       =      mserd
     Number of obs |       256      217059            Kernel        = Triangular
Eff. Number of obs |       150         370            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   198.139     198.139
       BW bias (b) |   392.083     392.083
         rho (h/b) |     0.505       0.505
        Unique obs |        86        1171

Outcome: NAC_PESO_imp50. Running variable: NAC_PESO_MADRE.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  54.672     101.77   0.5372   0.591   -144.794      254.138
    Bias-corrected |  95.354     101.77   0.9370   0.349   -104.112      294.821
            Robust |  95.354     118.96   0.8016   0.423   -137.798      328.506
--------------------------------------------------------------------------------
Scale parameter: -1
Estimates adjusted for mass points in the running variable.

added scalar:
               e(Hopt) =  198.13891

added scalar:
                 e(Nl) =  150

added scalar:
                 e(Nr) =  370

added scalar:
             e(effopt) =  520

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
NAC_PES~mp50 |        520    3169.686    505.3383        600       4480

added scalar:
             e(dvmean) =  3169.6856
  0

added scalar:
              e(N_l_i) =  0
  71

added scalar:
              e(N_r_i) =  71
Mass points detected in the running variable.

RD Plot with RD plot with manually set number of bins.

      Cutoff c = 1500 | Left of c  Right of c        Number of obs  =        582
----------------------+----------------------        Kernel         =    Uniform
        Number of obs |       159         423
   Eff. Number of obs |       159         423
  Order poly. fit (p) |         2           2
     BW poly. fit (h) |   200.000     200.000
 Number of bins scale |     1.000       1.000

Outcome: NAC_PESO_imp60. Running variable: NAC_PESO_MADRE.
---------------------------------------------
                      | Left of c  Right of c
----------------------+----------------------
        Bins selected |        10          10
   Average bin length |    20.000      20.000
    Median bin length |    20.000      20.000
----------------------+----------------------
    IMSE-optimal bins |        10           5
  Mimicking Var. bins |        19          16
----------------------+----------------------
Rel. to IMSE-optimal: | 
        Implied scale |     1.000       2.000
    WIMSE var. weight |     0.500       0.111
    WIMSE bias weight |     0.500       0.889
---------------------------------------------

Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

   Cutoff c = 1500 | Left of c  Right of c            Number of obs =     217315
-------------------+----------------------            BW type       =      mserd
     Number of obs |       256      217059            Kernel        = Triangular
Eff. Number of obs |       150         370            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   195.387     195.387
       BW bias (b) |   391.119     391.119
         rho (h/b) |     0.500       0.500
        Unique obs |        86        1171

Outcome: NAC_PESO_imp60. Running variable: NAC_PESO_MADRE.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  51.849     102.94   0.5037   0.614   -149.917      253.615
    Bias-corrected |  93.484     102.94   0.9081   0.364   -108.282       295.25
            Robust |  93.484     119.94   0.7794   0.436   -141.603      328.571
--------------------------------------------------------------------------------
Scale parameter: -1
Estimates adjusted for mass points in the running variable.

added scalar:
               e(Hopt) =  195.38655

added scalar:
                 e(Nl) =  150

added scalar:
                 e(Nr) =  370

added scalar:
             e(effopt) =  520

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
NAC_PES~mp60 |        520    3186.167    509.5035        600       4480

added scalar:
             e(dvmean) =  3186.1673
  0

added scalar:
              e(N_l_i) =  0
  71

added scalar:
              e(N_r_i) =  71
Mass points detected in the running variable.

RD Plot with RD plot with manually set number of bins.

      Cutoff c = 1500 | Left of c  Right of c        Number of obs  =        582
----------------------+----------------------        Kernel         =    Uniform
        Number of obs |       159         423
   Eff. Number of obs |       159         423
  Order poly. fit (p) |         2           2
     BW poly. fit (h) |   200.000     200.000
 Number of bins scale |     1.000       1.000

Outcome: NAC_PESO_imp70. Running variable: NAC_PESO_MADRE.
---------------------------------------------
                      | Left of c  Right of c
----------------------+----------------------
        Bins selected |        10          10
   Average bin length |    20.000      20.000
    Median bin length |    20.000      20.000
----------------------+----------------------
    IMSE-optimal bins |        10           6
  Mimicking Var. bins |        19          21
----------------------+----------------------
Rel. to IMSE-optimal: | 
        Implied scale |     1.000       1.667
    WIMSE var. weight |     0.500       0.178
    WIMSE bias weight |     0.500       0.822
---------------------------------------------

Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

   Cutoff c = 1500 | Left of c  Right of c            Number of obs =     217315
-------------------+----------------------            BW type       =      mserd
     Number of obs |       256      217059            Kernel        = Triangular
Eff. Number of obs |       150         370            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   195.803     195.803
       BW bias (b) |   391.218     391.218
         rho (h/b) |     0.500       0.500
        Unique obs |        86        1171

Outcome: NAC_PESO_imp70. Running variable: NAC_PESO_MADRE.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  29.927     103.19   0.2900   0.772   -172.315      232.168
    Bias-corrected |  71.617     103.19   0.6941   0.488   -130.625      273.859
            Robust |  71.617     120.22   0.5957   0.551   -164.005      307.239
--------------------------------------------------------------------------------
Scale parameter: -1
Estimates adjusted for mass points in the running variable.

added scalar:
               e(Hopt) =  195.80315

added scalar:
                 e(Nl) =  150

added scalar:
                 e(Nr) =  370

added scalar:
             e(effopt) =  520

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
NAC_PES~mp70 |        520    3199.475    515.0293        600       4480

added scalar:
             e(dvmean) =  3199.475
  0

added scalar:
              e(N_l_i) =  0
  71

added scalar:
              e(N_r_i) =  71
Mass points detected in the running variable.

RD Plot with RD plot with manually set number of bins.

      Cutoff c = 1500 | Left of c  Right of c        Number of obs  =        582
----------------------+----------------------        Kernel         =    Uniform
        Number of obs |       159         423
   Eff. Number of obs |       159         423
  Order poly. fit (p) |         2           2
     BW poly. fit (h) |   200.000     200.000
 Number of bins scale |     1.000       1.000

Outcome: NAC_PESO_imp80. Running variable: NAC_PESO_MADRE.
---------------------------------------------
                      | Left of c  Right of c
----------------------+----------------------
        Bins selected |        10          10
   Average bin length |    20.000      20.000
    Median bin length |    20.000      20.000
----------------------+----------------------
    IMSE-optimal bins |        10           7
  Mimicking Var. bins |        19          18
----------------------+----------------------
Rel. to IMSE-optimal: | 
        Implied scale |     1.000       1.429
    WIMSE var. weight |     0.500       0.255
    WIMSE bias weight |     0.500       0.745
---------------------------------------------

Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

   Cutoff c = 1500 | Left of c  Right of c            Number of obs =     217315
-------------------+----------------------            BW type       =      mserd
     Number of obs |       256      217059            Kernel        = Triangular
Eff. Number of obs |       150         370            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   195.318     195.318
       BW bias (b) |   391.309     391.309
         rho (h/b) |     0.499       0.499
        Unique obs |        86        1171

Outcome: NAC_PESO_imp80. Running variable: NAC_PESO_MADRE.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.2085     104.16   0.0308   0.975   -200.941      207.358
    Bias-corrected |   45.42     104.16   0.4361   0.663    -158.73      249.569
            Robust |   45.42     121.12   0.3750   0.708   -191.967      282.806
--------------------------------------------------------------------------------
Scale parameter: -1
Estimates adjusted for mass points in the running variable.

added scalar:
               e(Hopt) =  195.31782

added scalar:
                 e(Nl) =  150

added scalar:
                 e(Nr) =  370

added scalar:
             e(effopt) =  520

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
NAC_PES~mp80 |        520     3220.71    528.2815        600       4480

added scalar:
             e(dvmean) =  3220.7096
  0

added scalar:
              e(N_l_i) =  0
  71

added scalar:
              e(N_r_i) =  71
Mass points detected in the running variable.

RD Plot with RD plot with manually set number of bins.

      Cutoff c = 1500 | Left of c  Right of c        Number of obs  =        582
----------------------+----------------------        Kernel         =    Uniform
        Number of obs |       159         423
   Eff. Number of obs |       159         423
  Order poly. fit (p) |         2           2
     BW poly. fit (h) |   200.000     200.000
 Number of bins scale |     1.000       1.000

Outcome: NAC_PESO_imp90. Running variable: NAC_PESO_MADRE.
---------------------------------------------
                      | Left of c  Right of c
----------------------+----------------------
        Bins selected |        10          10
   Average bin length |    20.000      20.000
    Median bin length |    20.000      20.000
----------------------+----------------------
    IMSE-optimal bins |        10           8
  Mimicking Var. bins |        19          15
----------------------+----------------------
Rel. to IMSE-optimal: | 
        Implied scale |     1.000       1.250
    WIMSE var. weight |     0.500       0.339
    WIMSE bias weight |     0.500       0.661
---------------------------------------------

Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

   Cutoff c = 1500 | Left of c  Right of c            Number of obs =     217315
-------------------+----------------------            BW type       =      mserd
     Number of obs |       256      217059            Kernel        = Triangular
Eff. Number of obs |       150         370            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   196.410     196.410
       BW bias (b) |   393.184     393.184
         rho (h/b) |     0.500       0.500
        Unique obs |        86        1171

Outcome: NAC_PESO_imp90. Running variable: NAC_PESO_MADRE.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -33.662     105.02   -0.3205  0.749   -239.496      172.173
    Bias-corrected |  8.9675     105.02   0.0854   0.932   -196.867      214.802
            Robust |  8.9675     121.88   0.0736   0.941   -229.915       247.85
--------------------------------------------------------------------------------
Scale parameter: -1
Estimates adjusted for mass points in the running variable.

added scalar:
               e(Hopt) =  196.40966

added scalar:
                 e(Nl) =  150

added scalar:
                 e(Nr) =  370

added scalar:
             e(effopt) =  520

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
NAC_PES~mp90 |        520    3245.666    550.3169        600       4480

added scalar:
             e(dvmean) =  3245.6663
  0

added scalar:
              e(N_l_i) =  0
  71

added scalar:
              e(N_r_i) =  71

. 
. ////////////////////////////////////////////////////////////////////////////////
> * OUTPUTS:
. 
. ********************************************************************************
. * Export graphs as .gph:
. graph dir
    g2sm_peso_o32_optbw_10bins     g2sm_pesoi20_o32_optbw_10bins  g2sm_pesoi40_o32_optbw_10bins  g2sm_pesoi60_o32_optbw_10bins  g2sm_pesoi80_o32_optbw_10bins
    g2sm_pesoi10_o32_optbw_10bins  g2sm_pesoi30_o32_optbw_10bins  g2sm_pesoi50_o32_optbw_10bins  g2sm_pesoi70_o32_optbw_10bins  g2sm_pesoi90_o32_optbw_10bins

. foreach g in `r(list)' {
  2.         graph save `g' "$figsdir/`g'.gph", replace
  3. }
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_peso_o32_optbw_10bins.gph not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_peso_o32_optbw_10bins.gph saved)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi10_o32_optbw_10bins.gph not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi10_o32_optbw_10bins.gph saved)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi20_o32_optbw_10bins.gph not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi20_o32_optbw_10bins.gph saved)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi30_o32_optbw_10bins.gph not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi30_o32_optbw_10bins.gph saved)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi40_o32_optbw_10bins.gph not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi40_o32_optbw_10bins.gph saved)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi50_o32_optbw_10bins.gph not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi50_o32_optbw_10bins.gph saved)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi60_o32_optbw_10bins.gph not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi60_o32_optbw_10bins.gph saved)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi70_o32_optbw_10bins.gph not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi70_o32_optbw_10bins.gph saved)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi80_o32_optbw_10bins.gph not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi80_o32_optbw_10bins.gph saved)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi90_o32_optbw_10bins.gph not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi90_o32_optbw_10bins.gph saved)

. 
. * Export graphs as .eps:
. graph dir
    g2sm_peso_o32_optbw_10bins     g2sm_pesoi20_o32_optbw_10bins  g2sm_pesoi40_o32_optbw_10bins  g2sm_pesoi60_o32_optbw_10bins  g2sm_pesoi80_o32_optbw_10bins
    g2sm_pesoi10_o32_optbw_10bins  g2sm_pesoi30_o32_optbw_10bins  g2sm_pesoi50_o32_optbw_10bins  g2sm_pesoi70_o32_optbw_10bins  g2sm_pesoi90_o32_optbw_10bins

. foreach g in `r(list)' {
  2.         graph export "$figsdir/`g'.eps", replace name(`g')
  3. }
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_peso_o32_optbw_10bins.eps not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_peso_o32_optbw_10bins.eps written in EPS format)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi10_o32_optbw_10bins.eps not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi10_o32_optbw_10bins.eps written in EPS format)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi20_o32_optbw_10bins.eps not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi20_o32_optbw_10bins.eps written in EPS format)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi30_o32_optbw_10bins.eps not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi30_o32_optbw_10bins.eps written in EPS format)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi40_o32_optbw_10bins.eps not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi40_o32_optbw_10bins.eps written in EPS format)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi50_o32_optbw_10bins.eps not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi50_o32_optbw_10bins.eps written in EPS format)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi60_o32_optbw_10bins.eps not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi60_o32_optbw_10bins.eps written in EPS format)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi70_o32_optbw_10bins.eps not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi70_o32_optbw_10bins.eps written in EPS format)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi80_o32_optbw_10bins.eps not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi80_o32_optbw_10bins.eps written in EPS format)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi90_o32_optbw_10bins.eps not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi90_o32_optbw_10bins.eps written in EPS format)

. 
. * Export graphs as .png:
. graph dir
    g2sm_peso_o32_optbw_10bins     g2sm_pesoi20_o32_optbw_10bins  g2sm_pesoi40_o32_optbw_10bins  g2sm_pesoi60_o32_optbw_10bins  g2sm_pesoi80_o32_optbw_10bins
    g2sm_pesoi10_o32_optbw_10bins  g2sm_pesoi30_o32_optbw_10bins  g2sm_pesoi50_o32_optbw_10bins  g2sm_pesoi70_o32_optbw_10bins  g2sm_pesoi90_o32_optbw_10bins

. foreach g in `r(list)' {
  2.         graph export "$figsdir/`g'.png", replace name(`g')
  3. }
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_peso_o32_optbw_10bins.png not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_peso_o32_optbw_10bins.png written in PNG format)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi10_o32_optbw_10bins.png not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi10_o32_optbw_10bins.png written in PNG format)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi20_o32_optbw_10bins.png not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi20_o32_optbw_10bins.png written in PNG format)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi30_o32_optbw_10bins.png not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi30_o32_optbw_10bins.png written in PNG format)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi40_o32_optbw_10bins.png not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi40_o32_optbw_10bins.png written in PNG format)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi50_o32_optbw_10bins.png not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi50_o32_optbw_10bins.png written in PNG format)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi60_o32_optbw_10bins.png not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi60_o32_optbw_10bins.png written in PNG format)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi70_o32_optbw_10bins.png not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi70_o32_optbw_10bins.png written in PNG format)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi80_o32_optbw_10bins.png not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi80_o32_optbw_10bins.png written in PNG format)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi90_o32_optbw_10bins.png not found)
(file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/figures/g2sm_pesoi90_o32_optbw_10bins.png written in PNG format)

. 
. ********************************************************************************
. * Export results as .ster files:
. 
. estimates dir

-------------------------------------------------------
        name | command      depvar       npar  title 
-------------+-----------------------------------------
g2sm_peso_~w | rdrobust     NAC_PESO        3  
g2sm_pesoi~w | rdrobust     NAC_PES~mp10    3  
g2sm_pesoi~w | rdrobust     NAC_PES~mp20    3  
g2sm_pesoi~w | rdrobust     NAC_PES~mp30    3  
g2sm_pesoi~w | rdrobust     NAC_PES~mp40    3  
g2sm_pesoi~w | rdrobust     NAC_PES~mp50    3  
g2sm_pesoi~w | rdrobust     NAC_PES~mp60    3  
g2sm_pesoi~w | rdrobust     NAC_PES~mp70    3  
g2sm_pesoi~w | rdrobust     NAC_PES~mp80    3  
g2sm_pesoi~w | rdrobust     NAC_PES~mp90    3  
-------------------------------------------------------

. foreach result in `r(names)' {
  2.         estimates restore `result'
  3.         estimates save "$estdir/`result'", replace
  4. }
(results g2sm_peso_o32_optbw are active now)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_peso_o32_optbw.ster not found)
file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_peso_o32_optbw.ster saved
(results g2sm_pesoi10_o32_optbw are active now)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_pesoi10_o32_optbw.ster not found)
file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_pesoi10_o32_optbw.ster saved
(results g2sm_pesoi20_o32_optbw are active now)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_pesoi20_o32_optbw.ster not found)
file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_pesoi20_o32_optbw.ster saved
(results g2sm_pesoi30_o32_optbw are active now)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_pesoi30_o32_optbw.ster not found)
file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_pesoi30_o32_optbw.ster saved
(results g2sm_pesoi40_o32_optbw are active now)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_pesoi40_o32_optbw.ster not found)
file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_pesoi40_o32_optbw.ster saved
(results g2sm_pesoi50_o32_optbw are active now)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_pesoi50_o32_optbw.ster not found)
file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_pesoi50_o32_optbw.ster saved
(results g2sm_pesoi60_o32_optbw are active now)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_pesoi60_o32_optbw.ster not found)
file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_pesoi60_o32_optbw.ster saved
(results g2sm_pesoi70_o32_optbw are active now)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_pesoi70_o32_optbw.ster not found)
file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_pesoi70_o32_optbw.ster saved
(results g2sm_pesoi80_o32_optbw are active now)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_pesoi80_o32_optbw.ster not found)
file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_pesoi80_o32_optbw.ster saved
(results g2sm_pesoi90_o32_optbw are active now)
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_pesoi90_o32_optbw.ster not found)
file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/results/g2sm_pesoi90_o32_optbw.ster saved

. 
. 
. ////////////////////////////////////////////////////////////////////////////////
> * Prepare tables:
. local ests ${abbrev}_o32_optbw ${abbrev}i??_o32_optbw

. 
. * Display results:
. esttab `ests', ///
>         cells(b(fmt(%-9.4f) star) se(fmt(%-9.4f) par([ ]) )) label ///
>         nonotes nogaps collabels(none) modelwidth(10) ///
>         stats(dvmean N Hopt effopt Nl Nr N_l_i N_r_i, fmt(%05.3f %12.0gc %5.1f %9.0gc %9.0gc %9.0gc %9.0gc %9.0gc) ///
>    label("Mean of Dep. Var." "Observations" "Optimal Bandwidth" ///
>       "Effective Observations" "Observations (left)" "Observations (right)" ///
>                         "Imputed Obs. (left)" "Imputed Obs. (right)")) ///
>         starlevel("*" 0.1 "**" 0.05 "***" 0.01) ///
>         mtitles("Baseline" "10th" "20th" "30th" "40th" "Median" "60th" "70th" "80th" "90th")

----------------------------------------------------------------------------------------------------------------------------------------------------------------
                            (1)           (2)           (3)           (4)           (5)           (6)           (7)           (8)           (9)          (10)   
                       Baseline          10th          20th          30th          40th        Median          60th          70th          80th          90th   
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Conventional            63.6593      170.7876*     122.5025       98.2890       77.0329       54.6720       51.8491       29.9267        3.2085      -33.6615   
                     [104.2679]    [100.3285]    [100.4265]    [101.4745]    [101.5536]    [101.7705]    [102.9438]    [103.1865]    [104.1600]    [105.0194]   
Bias-corrected         105.7226      210.4376**    162.3713      138.4595      117.4437       95.3543       93.4841       71.6172       45.4196        8.9675   
                     [104.2679]    [100.3285]    [100.4265]    [101.4745]    [101.5536]    [101.7705]    [102.9438]    [103.1865]    [104.1600]    [105.0194]   
Robust                 105.7226      210.4376*     162.3713      138.4595      117.4437       95.3543       93.4841       71.6172       45.4196        8.9675   
                     [121.5026]    [118.4008]    [118.1211]    [118.8246]    [118.8359]    [118.9573]    [119.9446]    [120.2173]    [121.1177]    [121.8811]   
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Mean of Dep. Var.      3149.228      3070.593      3103.918      3138.772      3153.873      3169.686      3186.167      3199.475      3220.710      3245.666   
Observations            215,069       217,315       217,315       217,315       217,315       217,315       217,315       217,315       217,315       217,315   
Optimal Bandwidth         202.2         206.3         202.4         199.6         198.7         198.1         195.4         195.8         195.3         196.4   
Effective Observat~s        505           583           582           520           520           520           520           520           520           520   
Observations (left)         159           159           159           150           150           150           150           150           150           150   
Observations (right)        346           424           423           370           370           370           370           370           370           370   
Imputed Obs. (left)                         0             0             0             0             0             0             0             0             0   
Imputed Obs. (right)                       78            77            71            71            71            71            71            71            71   
----------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
.         
. /* 
> Baseline estimates an approximately -274.84 gram effect of treatment (not 
> statistically significant).
> 
> Even if the girls that died within 1 year of life had somehow survived and given
> birth to girls in the 10th percentile of weight, the effect of treatment would 
> still be far from zero, although statistically significant.
> 
> This is evidence of strong negative selection in the control group.
> */
. 
. 
. ********************************************************************************
. * Export results:
. local texfilename = `"${id_user_prefix}_`=subinstr("${S_DATE}", " ", "", .)'_${abbrev}_selection"'

. #delimit ;
delimiter now ;
. esttab `ests' using "$tbldir/`texfilename'.tex",
> replace booktabs cells(b(fmt(%-9.4f) star) se(fmt(%-9.4f) par([ ]) )) label
> stats(dvmean N Hopt effopt Nl Nr, fmt(%05.3f %12.0gc %5.1f %9.0gc %9.0gc %9.0gc) 
>    label("Mean of Dep. Var." "Observations" "Optimal Bandwidth" 
>       "Effective Observations" "Observations (left)" "Observations (right)"))
> nonotes nogaps nonumbers style(tex) fragment noline keep(Robust)
> mtitles("Baseline" "10th" "20th" "30th" "40th" "Median" "60th" "70th" "80th" "90th")
> collabels(none) starlevel("*" 0.1 "**" 0.05 "***" 0.01);
(note: file C:/Users/nicol/Dropbox/Research Projects/Intergenerational/textables/nlillob_13Sep2021_g2sm_peso_selection.tex not found)
(output written to C:/Users/nicol/Dropbox/Research Projects/Intergenerational/textables/nlillob_13Sep2021_g2sm_peso_selection.tex)

. #delimit cr
delimiter now cr
. 
. * close log:
. log close _all
      name:  masterlog
       log:  C:/Users/nicol/Dropbox/Research Projects/Intergenerational/statalogs/nlillob_20210913_g2sm_peso.log
  log type:  text
 closed on:  13 Sep 2021, 19:26:45
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
